linkedin-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/linkedin/getLinkedInProfile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.linkedin.getlinkedinprofile">
   <soapenv:Header/>
   <soapenv:Body>
            <urn:accessToken>AQWMZajhcaCTbXa6RN5Yw8vYaF4BPirPMhBB0aWa0KiuEAmHiQPZuO5oUNq9KSH1k_1QhEG3MVNLG3M4e_oFl2ermx7soWnKjCggCy02T1V9WmEbCBZvXCznj4yRRf4UZ_5r2fntnzMe_SYD9Xbl45EU85j71uwD7a_FoN-tk9JEdtAjPeY</urn:accessToken>
            <urn:appUri>http://api.linkedin.com/v1</urn:appUri>
			<urn:memberId>309997625</urn:memberId>
            <urn:publicUrl></urn:publicUrl>
   </soapenv:Body>
</soapenv:Envelope>


<!--

sample accesstoken : AQWMZajhcaCTbXa6RN5Yw8vYaF4BPirPMhBB0aWa0KiuEAmHiQPZuO5oUNq9KSH1k_1QhEG3MVNLG3M4e_oFl2ermx7soWnKjCggCy02T1V9WmEbCBZvXCznj4yRRf4UZ_5r2fntnzMe_SYD9Xbl45EU85j71uwD7a_FoN-tk9JEdtAjPeY
sample memberId    :309997625
sample publicUrl (urn encoded)  :http%3A%2F%2Fwww.linkedin.com%2Fpub%2Fwso2connector-abdera%2F87%2F998%2F935
scenario1: pass only accessToken ; leave the rest empty
scenario2: pass accessToken and the memberId leave publicUrl empty
scenario3: pass accessToken and the publicUrl leave memberId empty

-->
